<a href="https://colab.research.google.com/github/Datriks/Python_Repo/blob/master/Split_a_name_in_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df = pd.DataFrame({'Name':['Wayne, Bruce', 'Storm, Sue','Parker, Peter','Wilson, Barbara','Kent, Klark']})
df

              Name
0     Wayne, Bruce
1       Storm, Sue
2    Parker, Peter
3  Wilson, Barbara
4      Kent, Klark

In [0]:
df[['Last Name','First Name']] = df['Name'].str.split(', ', expand=True)
df

              Name Last Name First Name
0     Wayne, Bruce     Wayne      Bruce
1       Storm, Sue     Storm        Sue
2    Parker, Peter    Parker      Peter
3  Wilson, Barbara    Wilson    Barbara
4      Kent, Klark      Kent      Klark